ruslanbd/geekvape-t200MOD/Common Platform_V1.0.6/Soft Development Platform/Nations Device PACK Add To IAR Tool V1.1.14/Nations Device PACK/debugger/Nations/N32G43x/N32G435.svd
            </registers>
        </peripheral>

        <peripheral>
            <name>CAN</name>
            <description>Controller area network</description>
            <groupName>CAN</groupName>
            <baseAddress>0x40006400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>CAN_TX</name>
                <description>CAN TX interrupts</description>
                <value>53</value>
            </interrupt>
            <interrupt>
                <name>CAN_RX0</name>
                <description>CAN RX0 interrupts</description>
                <value>54</value>
            </interrupt>
            <interrupt>
                <name>CAN_RX1</name>
                <description>CAN RX1 interrupts</description>
                <value>55</value>
            </interrupt>
            <interrupt>
                <name>CAN_SCE</name>
                <description>CAN SCE interrupt</description>
                <value>56</value>
            </interrupt>
            <registers>
                <register>
                    <name>CAN_MCTRL</name>
                    <displayName>CAN_MCTRL</displayName>
                    <description>CAN_MCTRL</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00010002</resetValue>
                    <resetMask>0x000180ff</resetMask>
                    <fields>
                        <field>
                            <name>INIRQ</name>
                            <description>INIRQ</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLPRQ</name>
                            <description>SLPRQ</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXFP</name>
                            <description>TXFP</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RFLM</name>
                            <description>RFLM</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NART</name>
                            <description>NART</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>AWKUM</name>
                            <description>AWKUM</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ABOM</name>
                            <description>ABOM</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TTCM</name>
                            <description>TTCM</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MRST</name>
                            <description>MRST</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DBGF</name>
                            <description>DBGF</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CAN_MSTS</name>
                    <displayName>CAN_MSTS</displayName>
                    <description>CAN_MSTS</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000c02</resetValue>
                    <resetMask>0x00000f1f</resetMask>
                    <fields>
                        <field>
                            <name>INIAK</name>
                            <description>INIAK</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLPAK</name>
                            <description>SLPAK</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ERRINT</name>
                            <description>ERRINT</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WKUINT</name>
                            <description>WKUINT</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLAKINT</name>
                            <description>SLAKINT</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXMD</name>
                            <description>TXMD</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXMD</name>
                            <description>RXMD</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LSMP</name>
                            <description>LSMP</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXS</name>
                            <description>RXS</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CAN_TSTS</name>
                    <displayName>CAN_TSTS</displayName>
                    <description>CAN_TSTS</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x1c000000</resetValue>
                    <resetMask>0xff8f8f8f</resetMask>
                    <fields>
                        <field>
                            <name>RQCPM0</name>
                            <description>RQCPM0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXOKM0</name>
                            <description>TXOKM0</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ALSTM0</name>
                            <description>ALSTM0</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TERRM0</name>
                            <description>TERRM0</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ABRQM0</name>
                            <description>ABRQM0</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RQCPM1</name>
                            <description>RQCPM1</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXOKM1</name>
                            <description>TXOKM1</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ALSTM1</name>
                            <description>ALSTM1</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TERRM1</name>
                            <description>TERRM1</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ABRQM1</name>
                            <description>ABRQM1</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RQCPM2</name>
                            <description>RQCPM2</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXOKM2</name>
                            <description>TXOKM2</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ALSTM2</name>
                            <description>ALSTM2</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TERRM2</name>
                            <description>TERRM2</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ABRQM2</name>
                            <description>ABRQM2</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CODE</name>
                            <description>CODE</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>TMEM</name>
                            <description>TMEM</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>LOWM</name>
                            <description>LOWM</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CAN_RFF0</name>
                    <displayName>CAN_RFF0</displayName>
                    <description>CAN_RFF0</description>
                    <addressOffset>0xc</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000003b</resetMask>
                    <fields>
                        <field>
                            <name>FFMP0</name>
                            <description>FFMP0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>FFULL0</name>
                            <description>FFULL0</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FFOVR0</name>
                            <description>FFOVR0</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RFFOM0</name>
                            <description>RFFOM0</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CAN_RFF1</name>
                    <displayName>CAN_RFF1</displayName>
                    <description>CAN_RFF1</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000003b</resetMask>
                    <fields>
                        <field>
                            <name>FFMP1</name>
                            <description>FFMP1</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>FFULL1</name>
                            <description>FFULL1</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FFOVR1</name>
                            <description>FFOVR1</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RFFOM1</name>
                            <description>RFFOM1</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CAN_INTE</name>
                    <displayName>CAN_INTE</displayName>
                    <description>CAN_INTE</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00038f7f</resetMask>
                    <fields>
                        <field>
                            <name>TMEITE</name>
                            <description>TMEITE</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FMPITE0</name>
                            <description>FMPITE0</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FFITE0</name>
                            <description>FFITE0</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FOVITE0</name>
                            <description>FOVITE0</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FMPITE1</name>
                            <description>FMPITE1</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FFITE1</name>
                            <description>FFITE1</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FOVITE1</name>
                            <description>FOVITE1</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EWGITE</name>
                            <description>EWGITE</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EPVITE</name>
                            <description>EPVITE</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BOFITE</name>
                            <description>BOFITE</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LECITE</name>
                            <description>LECITE</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ERRITE</name>
                            <description>ERRITE</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WKUITE</name>
                            <description>WKUITE</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLKITE</name>
                            <description>SLKITE</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CAN_ESTS</name>
                    <displayName>CAN_ESTS</displayName>
                    <description>CAN_ESTS</description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffff0077</resetMask>
                    <fields>
                        <field>
                            <name>EWGFL</name>
                            <description>EWGFL</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EPVFL</name>
                            <description>EPVFL</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BOFFL</name>
                            <description>BOFFL</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEC</name>
                            <description>LEC</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>TXEC</name>
                            <description>TXEC</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>RXEC</name>
                            <description>RXEC</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
