ruslanbd/geekvape-t200MOD/Common Platform_V1.0.6/Soft Development Platform/Nations Device PACK Add To IAR Tool V1.1.14/Nations Device PACK/debugger/Nations/N32G43x/N32G435.svd
                <register>
                    <name>TSC_THRHD5</name>
                    <displayName>TSC_THRHD5</displayName>
                    <description>TSC_THRHD5</description>
                    <addressOffset>0x38</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00800400</resetValue>
                    <resetMask>0x00ff07ff</resetMask>
                    <fields>
                        <field>
                            <name>BASE5</name>
                            <description>BASE5</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                        <field>
                            <name>DELTA5</name>
                            <description>DELTA5</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TSC_THRHD6</name>
                    <displayName>TSC_THRHD6</displayName>
                    <description>TSC_THRHD6</description>
                    <addressOffset>0x3c</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00800400</resetValue>
                    <resetMask>0x00ff07ff</resetMask>
                    <fields>
                        <field>
                            <name>BASE6</name>
                            <description>BASE6</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                        <field>
                            <name>DELTA6</name>
                            <description>DELTA6</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TSC_THRHD7</name>
                    <displayName>TSC_THRHD7</displayName>
                    <description>TSC_THRHD7</description>
                    <addressOffset>0x40</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00800400</resetValue>
                    <resetMask>0x00ff07ff</resetMask>
                    <fields>
                        <field>
                            <name>BASE7</name>
                            <description>BASE7</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                        <field>
                            <name>DELTA7</name>
                            <description>DELTA7</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TSC_THRHD8</name>
                    <displayName>TSC_THRHD8</displayName>
                    <description>TSC_THRHD8</description>
                    <addressOffset>0x44</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00800400</resetValue>
                    <resetMask>0x00ff07ff</resetMask>
                    <fields>
                        <field>
                            <name>BASE8</name>
                            <description>BASE8</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                        <field>
                            <name>DELTA8</name>
                            <description>DELTA8</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TSC_THRHD9</name>
                    <displayName>TSC_THRHD9</displayName>
                    <description>TSC_THRHD9</description>
                    <addressOffset>0x48</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00800400</resetValue>
                    <resetMask>0x00ff07ff</resetMask>
                    <fields>
                        <field>
                            <name>BASE9</name>
                            <description>BASE9</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                        <field>
                            <name>DELTA9</name>
                            <description>DELTA9</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TSC_THRHD10</name>
                    <displayName>TSC_THRHD10</displayName>
                    <description>TSC_THRHD10</description>
                    <addressOffset>0x4c</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00800400</resetValue>
                    <resetMask>0x00ff07ff</resetMask>
                    <fields>
                        <field>
                            <name>BASE10</name>
                            <description>BASE10</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                        <field>
                            <name>DELTA10</name>
                            <description>DELTA10</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TSC_THRHD11</name>
                    <displayName>TSC_THRHD11</displayName>
                    <description>TSC_THRHD11</description>
                    <addressOffset>0x50</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00800400</resetValue>
                    <resetMask>0x00ff07ff</resetMask>
                    <fields>
                        <field>
                            <name>BASE11</name>
                            <description>BASE11</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                        <field>
                            <name>DELTA11</name>
                            <description>DELTA11</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TSC_THRHD12</name>
                    <displayName>TSC_THRHD12</displayName>
                    <description>TSC_THRHD12</description>
                    <addressOffset>0x54</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00800400</resetValue>
                    <resetMask>0x00ff07ff</resetMask>
                    <fields>
                        <field>
                            <name>BASE12</name>
                            <description>BASE12</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                        <field>
                            <name>DELTA12</name>
                            <description>DELTA12</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TSC_THRHD13</name>
                    <displayName>TSC_THRHD13</displayName>
                    <description>TSC_THRHD13</description>
                    <addressOffset>0x58</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00800400</resetValue>
                    <resetMask>0x00ff07ff</resetMask>
                    <fields>
                        <field>
                            <name>BASE13</name>
                            <description>BASE13</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                        <field>
                            <name>DELTA13</name>
                            <description>DELTA13</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TSC_THRHD14</name>
                    <displayName>TSC_THRHD14</displayName>
                    <description>TSC_THRHD14</description>
                    <addressOffset>0x5c</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00800400</resetValue>
                    <resetMask>0x00ff07ff</resetMask>
                    <fields>
                        <field>
                            <name>BASE14</name>
                            <description>BASE14</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                        <field>
                            <name>DELTA14</name>
                            <description>DELTA14</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TSC_THRHD15</name>
                    <displayName>TSC_THRHD15</displayName>
                    <description>TSC_THRHD15</description>
                    <addressOffset>0x60</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00800400</resetValue>
                    <resetMask>0x00ff07ff</resetMask>
                    <fields>
                        <field>
                            <name>BASE15</name>
                            <description>BASE15</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                        <field>
                            <name>DELTA15</name>
                            <description>DELTA15</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TSC_THRHD16</name>
                    <displayName>TSC_THRHD16</displayName>
                    <description>TSC_THRHD16</description>
                    <addressOffset>0x64</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00800400</resetValue>
                    <resetMask>0x00ff07ff</resetMask>
                    <fields>
                        <field>
                            <name>BASE16</name>
                            <description>BASE16</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                        <field>
                            <name>DELTA16</name>
                            <description>DELTA16</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TSC_THRHD17</name>
                    <displayName>TSC_THRHD17</displayName>
                    <description>TSC_THRHD17</description>
                    <addressOffset>0x68</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00800400</resetValue>
                    <resetMask>0x00ff07ff</resetMask>
                    <fields>
                        <field>
                            <name>BASE17</name>
                            <description>BASE17</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                        <field>
                            <name>DELTA17</name>
                            <description>DELTA17</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TSC_THRHD18</name>
                    <displayName>TSC_THRHD18</displayName>
                    <description>TSC_THRHD18</description>
                    <addressOffset>0x6c</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00800400</resetValue>
                    <resetMask>0x00ff07ff</resetMask>
                    <fields>
                        <field>
                            <name>BASE18</name>
                            <description>BASE18</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                        <field>
                            <name>DELTA18</name>
                            <description>DELTA18</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TSC_THRHD19</name>
                    <displayName>TSC_THRHD19</displayName>
                    <description>TSC_THRHD19</description>
                    <addressOffset>0x70</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00800400</resetValue>
                    <resetMask>0x00ff07ff</resetMask>
                    <fields>
                        <field>
                            <name>BASE19</name>
                            <description>BASE19</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                        <field>
                            <name>DELTA19</name>
                            <description>DELTA19</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TSC_THRHD20</name>
                    <displayName>TSC_THRHD20</displayName>
                    <description>TSC_THRHD20</description>
                    <addressOffset>0x74</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00800400</resetValue>
                    <resetMask>0x00ff07ff</resetMask>
                    <fields>
                        <field>
                            <name>BASE20</name>
                            <description>BASE20</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                        <field>
                            <name>DELTA20</name>
                            <description>DELTA20</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
